app/views/shared/_feed_item.html.erb

SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN microposts ON microposts.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Micropost' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT microposts.id FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships
---
    <span class="content"><%= feed_item.content %></span>
    <span>Tags: <%= raw feed_item.tag_list.map {|t| link_to t, tag_path(t)}.join(', ') %></span>