app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save
---
INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "Hey everyone, what's going on with you?"], ["created_at", Mon, 08 Apr 2013 01:35:38 UTC +00:00], ["updated_at", Mon, 08 Apr 2013 01:35:38 UTC +00:00], ["user_id", 101]]