app/controllers/relationships_controller.rb

  def create
    @user = User.find(params[:relationship][:followed_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "101"]]