app/controllers/static_pages_controller.rb

  def home
    if signed_in?
      @micropost = current_user.microposts.build
      if params[:tag]
        @feed_items = current_user.feed.tagged_with(params[:tag]).paginate(page: params[:page])
---
SELECT "microposts".* FROM "microposts" JOIN taggings microposts_taggings_fedbe40 ON microposts_taggings_fedbe40.taggable_id = microposts.id AND microposts_taggings_fedbe40.taggable_type = 'Micropost' AND microposts_taggings_fedbe40.tag_id = 4 WHERE (user_id IN (SELECT followed_id FROM relationships
SELECT COUNT(*) FROM "microposts" JOIN taggings microposts_taggings_fedbe40 ON microposts_taggings_fedbe40.taggable_id = microposts.id AND microposts_taggings_fedbe40.taggable_type = 'Micropost' AND microposts_taggings_fedbe40.tag_id = 4 WHERE (user_id IN (SELECT followed_id FROM relationships
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN microposts ON microposts.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Micropost' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT microposts.id FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships